OSPP/OSPP2025/江飞兵-25aca0558-结项报告/lock-sched/test_db/benchmark_results_2025-08-26_10-12-06/scx_simple_128threads.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 3776.81 qps: 75694.10 (r/w/o: 53009.97/15117.72/7566.41) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 3060.90 qps: 61176.77 (r/w/o: 42821.15/12233.81/6121.81) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 3437.40 qps: 68858.05 (r/w/o: 48192.67/13790.59/6874.80) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 3541.30 qps: 70778.80 (r/w/o: 49556.40/14139.80/7082.60) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 3606.60 qps: 72157.64 (r/w/o: 50516.13/14428.31/7213.20) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 3761.99 qps: 75187.99 (r/w/o: 52624.72/15039.28/7523.99) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 3761.01 qps: 75197.62 (r/w/o: 52631.19/15044.42/7522.01) lat (ms,95%): 64.47 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 3759.90 qps: 75264.02 (r/w/o: 52699.71/15044.50/7519.80) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 3877.00 qps: 77550.02 (r/w/o: 54284.62/15511.40/7754.00) lat (ms,95%): 59.99 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 3993.99 qps: 79873.45 (r/w/o: 55915.10/15970.37/7987.99) lat (ms,95%): 62.19 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 3953.50 qps: 79067.95 (r/w/o: 55335.63/15825.81/7906.50) lat (ms,95%): 59.99 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 3922.50 qps: 78429.19 (r/w/o: 54914.26/15669.42/7845.51) lat (ms,95%): 58.92 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            6225226
        write:                           1778636
        other:                           889318
        total:                           8893180
    transactions:                        444659 (3703.18 per sec.)
    queries:                             8893180 (74063.58 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0745s
    total number of events:              444659

Latency (ms):
         min:                                    2.34
         avg:                                   34.55
         max:                                 1247.35
         95th percentile:                       65.65
         sum:                             15361627.44

Threads fairness:
    events (avg/stddev):           3473.8984/34.55
    execution time (avg/stddev):   120.0127/0.01